// // قم بإنشاء كائن لتخزين معلومات الطلاب والنتائج
// const studentData = {
//   22: {
//     name: "الاسم : احمد ابراهيم السكري",
//     average: 85,
//     subjects: {
//       "ادارة الاعمال": "جيد جدًا",
//       اقتصاد: "ممتاز",
//       رياضة: "ممتاز",
//       "محاسبة تكاليف": "جيد جدًا",
//       // ... وهكذا للمواد الأخرى
//     },
//   },
//   "رقم جلوس] 2": {
//     name: "اسم الطالب 2",
//     average: 92,
//     subjects: {
//       "مادة 1": "ممتاز",
//       "مادة 2": "ممتاز",
//       // ... وهكذا للمواد الأخرى
//     },
//   },
//   // ... وهكذا للطلاب الأخرين
// };

// document.addEventListener("DOMContentLoaded", function () {
//   const seatNumberInput = document.getElementById("seat-number");
//   const searchButton = document.getElementById("search-button");
//   const resultContainer = document.getElementById("result-container");

//   if (searchButton && seatNumberInput && resultContainer) {
//     searchButton.addEventListener("click", () => {
//       const seatNumber = seatNumberInput.value;
//       const studentInfo = studentData[seatNumber];

//       if (studentInfo) {
//         // window.location.href = "results.html";
//         const resultDiv = document.createElement("div");
//         resultDiv.className = "result";
//         resultDiv.style.direction = "rtl";
//         resultDiv.innerHTML = `
//                 <h2>${studentInfo.name}</h2>
//                 <p>المعدل: ${studentInfo.average}</p>
//                 <h3>نتائج المواد:</h3>
//                 <ul style="display: flex; padding: 10px; justify-content: space-evenly; margin: 4px; align-items: center;">
//                     ${Object.entries(studentInfo.subjects)
//                       .map(
//                         ([subject, grade]) =>
//                           `<li style="padding: 10px; margin: 4px; border: 1px solid;">${subject}: ${grade}</li>`
//                       )
//                       .join("")}
//                 </ul>
//             `;
//         resultContainer.innerHTML = "";
//         resultContainer.appendChild(resultDiv);
//       } else {
//         resultContainer.innerHTML = "<p>لا توجد معلومات لهذا رقم جلوس].</p>";
//       }
//     });
//   } else {
//     console.error("One or more elements not found or not loaded properly.");
//   }
// });










const jsonData = {
  "resalt":  [
    {
     "المعدل": 2.83,
     "تطبيقات الانترنت والوسائط المتعددة": "B",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ": "B",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370001,
     "الاسم": "احمد اشرف فرج علي مصطفى",
     "كود": 2022210053
    },
    {
     "المعدل": 2.87,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "A+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370002,
     "الاسم": "احمد حسن احمد عوض",
     "كود": 2022210071
    },
    {
     "المعدل": 2.67,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ": "D",
     "محاسبة التكاليف ": "D",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "D+",
     "رقم الجلوس": 370003,
     "الاسم": "احمد حماده جابر محمود",
     "كود": 2022210079
    },
    {
     "المعدل": 2.79,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "C+",
     "المراجعة":"B+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370004,
     "الاسم": "احمد حمدي السيد ابراهيم عابد",
     "كود": 2022210080
    },
    {
     "المعدل": 2.74,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370005,
     "الاسم": "احمد حمدي محمد احمد المسيرى",
     "كود": 2022210081
    },
    {
     "المعدل": 2.73,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "B",
     "المراجعة":"B+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370006,
     "الاسم": "احمد سعد الدين محمد مدكور حسن",
     "كود": 2022210096
    },
    {
     "المعدل": 0,
     "تطبيقات الانترنت والوسائط المتعددة": " | محجوب",
     "اقتصاديات التمويل الدولى ": "| محجوب",
     "محاسبة التكاليف ": "| محجوب",
     "المراجعة": "| محجوب",
     "فن الاعلان والعلاقات العامة": "| محجوب",
     "رقم الجلوس": 370007,
     "الاسم": "احمد عبدالحميد نعمان الشناوى شلبي",
     "كود": 2022210119
    },
    {
     "المعدل": 2.7,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "A",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370008,
     "الاسم": "احمد ياسر فاروق محمود المسيري",
     "كود": 2022210202
    },
    {
     "المعدل": 2.81,
     "تطبيقات الانترنت والوسائط المتعددة": "D",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "D+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370009,
     "الاسم": "اية عمر محمود عمر جمعه",
     "كود": 2022210347
    },
    {
     "المعدل": 0,
     "تطبيقات الانترنت والوسائط المتعددة": " | محجوب",
     "اقتصاديات التمويل الدولى ": "| محجوب",
     "محاسبة التكاليف ": "| محجوب",
     "المراجعة": "| محجوب",
     "فن الاعلان والعلاقات العامة": "| محجوب",
     "رقم الجلوس": 370010,
     "الاسم": "جنه ناصر حسين دياب",
     "كود": 2022210422
    },
    {
     "المعدل": 2.59,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370011,
     "الاسم": "حبيبه محمود احمد محمد حسن",
     "كود": 2022210450
    },
    {
     "المعدل": 3.28,
     "تطبيقات الانترنت والوسائط المتعددة":"A+",
     "اقتصاديات التمويل الدولى ": "A+",
     "محاسبة التكاليف ": "A",
     "المراجعة": "A+",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370012,
     "الاسم": "حسن اشرف حسن محمد",
     "كود": 2022210462
    },
    {
     "المعدل": 2.83,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ": "A",
     "محاسبة التكاليف ": "A",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370013,
     "الاسم": "حسن كامل حسن محمد هيكل",
     "كود": 2021130222
    },
    {
     "المعدل": 2.93,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "B",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370014,
     "الاسم": "سارة محمد محمد ابوالفضل",
     "كود": 2022210650
    },
    {
     "المعدل": 0,
     "تطبيقات الانترنت والوسائط المتعددة": " | محجوب",
     "اقتصاديات التمويل الدولى ": "| محجوب",
     "محاسبة التكاليف ": "| محجوب",
     "المراجعة": "| محجوب",
     "فن الاعلان والعلاقات العامة": "| محجوب",
     "رقم الجلوس": 370015,
     "الاسم": "شهد ناصف عبدالفتاح مصطفى",
     "كود": 2022210757
    },
    {
     "المعدل": 2.98,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "B",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370016,
     "الاسم": "شيماء محمد علي مرسي",
     "كود": 2022210764
    },
    {
     "المعدل": 3.04,
     "تطبيقات الانترنت والوسائط المتعددة":"A+",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ":"B+",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370017,
     "الاسم": "صابرين محمد فتح هللا عبدالحي",
     "كود": 2022210769
    },
    {
     "المعدل": 3.18,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "B",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370018,
     "الاسم": "ضحى اشرف عبدهللا عبدهللا عميش",
     "كود": 2022210782
    },
    {
     "المعدل": 3.01,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ": "A",
     "محاسبة التكاليف ":"B+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370019,
     "الاسم": "عبدالرحمن رضا حسني احمد أى الدين",
     "كود": 2022210835
    },
    {
     "المعدل": 2.86,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ": "A",
     "محاسبة التكاليف ": "A+",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370020,
     "الاسم": "عبدالرحمن عاطف رزق الهالوى",
     "كود": 2022210842
    },
    {
     "المعدل": 2.77,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "B",
     "المراجعة": "C+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370021,
     "الاسم": "عبدالرحمن عاطف كمال محمد",
     "كود": 2022210843
    },
    {
     "المعدل": 2.53,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ": "C",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "C+",
     "فن الاعلان والعلاقات العامة": "B",
     "رقم الجلوس": 370022,
     "الاسم": "عبدالرحمن محمد ابراهيم محمد اسماعيل",
     "كود": 2022210855
    },
    {
     "المعدل": 2.13,
     "تطبيقات الانترنت والوسائط المتعددة": "D",
     "اقتصاديات التمويل الدولى ": "D",
     "محاسبة التكاليف ": "D",
     "المراجعة": "| غياب",
     "فن الاعلان والعلاقات العامة": "| غياب",
     "رقم الجلوس": 370023,
     "الاسم": "عبدالرحمن محمود عبدالجواد عمار",
     "كود": 2022210867
    },
    {
     "المعدل": 2.75,
     "تطبيقات الانترنت والوسائط المتعددة": "D",
     "اقتصاديات التمويل الدولى ": "C",
     "محاسبة التكاليف ": "D+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370024,
     "الاسم": "عبدهللا دسوقي بيومي دسوقي",
     "كود": 2022210892
    },
    {
     "المعدل": 3.18,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ": "A+",
     "محاسبة التكاليف ": "A+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370025,
     "الاسم": "علي عبدالحميد على بسطويسي",
     "كود": 2022210937
    },
    {
     "المعدل": 2.85,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "C",
     "المراجعة":"B+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370026,
     "الاسم": "عمرو محمد مصطفى محمد",
     "كود": 2022210993
    },
    {
     "المعدل": 2.58,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "C+",
     "المراجعة":"B+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370027,
     "الاسم": "فارس عبدالجليل حسن الطور",
     "كود": 2022211009
    },
    {
     "المعدل": 3.32,
     "تطبيقات الانترنت والوسائط المتعددة":"A+",
     "اقتصاديات التمويل الدولى ": "A+",
     "محاسبة التكاليف ": "A+",
     "المراجعة": "A+",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370028,
     "الاسم": "كريم حمدان حسين عبدالقادر",
     "كود": 2022211050
    },
    {
     "المعدل": 2.31,
     "تطبيقات الانترنت والوسائط المتعددة": "C",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "C",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "B",
     "رقم الجلوس": 370029,
     "الاسم": "كريم محمد صالح ابوالعنين حمود",
     "كود": 2022211060
    },
    {
     "المعدل": 3.09,
     "تطبيقات الانترنت والوسائط المتعددة": "B",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "B",
     "المراجعة": " B",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370030,
     "الاسم": "لمى احمد عبدالسالم عبدالحميد",
     "كود": 2022211077
    },
    {
     "المعدل": 3.16,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ": "A",
     "محاسبة التكاليف ":"B+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370031,
     "الاسم": "محمد رضا محمد يوسف نافع",
     "كود": 2022211195
    },
    {
     "المعدل": 3.08,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ":"B+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة":"B+",
     "رقم الجلوس": 370032,
     "الاسم": "محمد رضا يوسف المرشدي عبدهللا",
     "كود": 2022211196
    },
    {
     "المعدل": 2.42,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ":"B+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "B",
     "رقم الجلوس": 370033,
     "الاسم": "محمد شريف عبدالمنعم عطيه سليمان",
     "كود": 2022211221
    },
    {
     "المعدل": 3.27,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ": "A",
     "محاسبة التكاليف ": "A+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370036,
     "الاسم": "محمد ياسر احمد حافظ سيد احمد",
     "كود": 2022211339
    },
    {
     "المعدل": 2.48,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ": "A",
     "محاسبة التكاليف ": "A+",
     "المراجعة":"B+",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370037,
     "الاسم": "محمود عادل محمد شبل عبدالعال",
     "كود": 2022211371
    },
    {
     "المعدل": 3.27,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ": "A",
     "محاسبة التكاليف ": "A+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370038,
     "الاسم": "محمود محمد حسن السيد الفخراني",
     "كود": 2022211383
    },
    {
     "المعدل": 2.77,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "A",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370039,
     "الاسم": "محمود محمد عزت حامد عبدالحميد",
     "كود": 2022211385
    },
    {
     "المعدل": 2.46,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "C",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "C",
     "رقم الجلوس": 370040,
     "الاسم": "محمود مصطفى شعبان غازي فوده",
     "كود": 2022211388
    },
    {
     "المعدل": 2.57,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "C",
     "فن الاعلان والعلاقات العامة": "D+",
     "رقم الجلوس": 370043,
     "الاسم": "مصطفى حمدي احمد محمود",
     "كود": 2022211452
    },
    {
     "المعدل": 2.87,
     "تطبيقات الانترنت والوسائط المتعددة":"A",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ":"B+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة":"B+",
     "رقم الجلوس": 370044,
     "الاسم": "مصطفى كامل على على النجار",
     "كود": 2022211470
    },
    {
     "المعدل": 3.16,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ": "A",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة":"B+",
     "رقم الجلوس": 370045,
     "الاسم": "معتز طلعت محمد سعيد",
     "كود": 2022211490
    },
    {
     "المعدل": 3.8,
     "تطبيقات الانترنت والوسائط المتعددة":"A+",
     "اقتصاديات التمويل الدولى ": "A+",
     "محاسبة التكاليف ": "A+",
     "المراجعة": "A+",
     "فن الاعلان والعلاقات العامة": "A+",
     "رقم الجلوس": 370046,
     "الاسم": "نسرين محمد عبدالعال رمضان",
     "كود": 2022211596
    },
    {
     "المعدل": 3.16,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ": "A",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة":"B+",
     "رقم الجلوس": 370047,
     "الاسم": "هبه هللا هاني مصطفى محمد رشاد",
     "كود": 2022211649
    },
    {
     "المعدل": 2.29,
     "تطبيقات الانترنت والوسائط المتعددة": " B",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "A",
     "فن الاعلان والعلاقات العامة": "D+",
     "رقم الجلوس": 370048,
     "الاسم": "ياسر سمير انور حسين خليل",
     "كود": 20213069
    },
    {
     "المعدل": 2.72,
     "تطبيقات الانترنت والوسائط المتعددة": "C",
     "اقتصاديات التمويل الدولى ": "C",
     "محاسبة التكاليف ": "B",
     "المراجعة": "A+",
     "فن الاعلان والعلاقات العامة":"B+",
     "رقم الجلوس": 370049,
     "الاسم": "ياسمين احمد حلمى البابلي",
     "كود": 2022211685
    },
    {
     "المعدل": 2.47,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ": "B",
     "محاسبة التكاليف ": "B",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "B",
     "رقم الجلوس": 370050,
     "الاسم": "يوسف صالح سعيد صالح القوري",
     "كود": 2022211724
    },
    {
     "المعدل": 2.49,
     "تطبيقات الانترنت والوسائط المتعددة": "B+",
     "اقتصاديات التمويل الدولى ": "C+",
     "محاسبة التكاليف ": "C+",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "C",
     "رقم الجلوس": 370051,
     "الاسم": "يوسف عبدالعزيز على محمد طلبه",
     "كود": 2022211730
    },
    {
     "المعدل": 2.82,
     "تطبيقات الانترنت والوسائط المتعددة": "C+",
     "اقتصاديات التمويل الدولى ":"B+",
     "محاسبة التكاليف ":"B+",
     "المراجعة": "B",
     "فن الاعلان والعلاقات العامة": "A",
     "رقم الجلوس": 370052,
     "الاسم": "يوسف يحيى غريب عصاميص",
     "كود": 2022211745
    },
   
   ]
  }


// // بيانات الطلاب من JSON
// const jsonData = {
//   "resalt": [
//     {
//       "التقدير العام": 2.51,
//       "مبادئ المحاسبة المالية": "B",
//       "تفكير الابتكاري": "B",
//       "مهارات الاتصال": "B",
//       "رياضة الاعمال": "C-",
//       "الإنجليزية": "A",
//       "علم نفس": "C+",
//       "سلوك تنظيمي": "C-",
//       "مبادئ إدارة الاعمال": "D+",
//       "مبادئ القانون": "D",
//       "مبادئ الاقتصاد": "B",
//       "الاسم": "ابراهيم احمد ابراهيم التلواني",
//       "رقم الجلوس": 50006
//     },
//     {
//       "التقدير العام": 2.32,
//       "مبادئ المحاسبة المالية": "B",
//       "تفكير الابتكاري": "C+",
//       "مهارات الاتصال": "C",
//       "رياضة الاعمال": "C",
//       "الإنجليزية": "C",
//       "علم نفس": "C+",
//       "سلوك تنظيمي": "C-",
//       "مبادئ إدارة الاعمال": "C-",
//       "مبادئ القانون": "D",
//       "مبادئ الاقتصاد": "C+",
//       "الاسم": "ابراهيم احمد محمد احمد تاج الدين",
//       "رقم الجلوس": 50007
//     },
//     {
//       "التقدير العام": 2,
//       "مبادئ المحاسبة المالية": "B",
//       "تفكير الابتكاري": "C-",
//       "مهارات الاتصال": "C-",
//       "رياضة الاعمال": "D+",
//       "الإنجليزية": "D+",
//       "علم نفس": "C+",
//       "سلوك تنظيمي": "D-",
//       "مبادئ إدارة الاعمال": "D-",
//       "مبادئ القانون": "C-",
//       "مبادئ الاقتصاد": "C+",
//       "الاسم": "ابراهيم جالل محمد شريف",
//       "رقم الجلوس": 50008
//     },
//     {
//       "التقدير العام": 2.09,
//       "مبادئ المحاسبة المالية": "B",
//       "تفكير الابتكاري": "C-",
//       "مهارات الاتصال": "C-",
//       "رياضة الاعمال": "C",
//       "الإنجليزية": "C+",
//       "علم نفس": "C-",
//       "سلوك تنظيمي": "C-",
//       "مبادئ إدارة الاعمال": "D-",
//       "مبادئ القانون": "D-",
//       "مبادئ الاقتصاد": "C",
//       "الاسم": "ابراهيم جمال االحمدي جمعه",
//       "رقم الجلوس": 50009
//     },
//     {
//       "التقدير العام": 1.88,
//       "مبادئ المحاسبة المالية": "B",
//       "تفكير الابتكاري": "C",
//       "مهارات الاتصال": "C+",
//       "رياضة الاعمال": "C",
//       "الإنجليزية": "F",
//       "علم نفس": "C",
//       "سلوك تنظيمي": "D+",
//       "مبادئ إدارة الاعمال": "D-",
//       "مبادئ القانون": "D-",
//       "مبادئ الاقتصاد": "C+",
//       "الاسم": "ابراهيم خالد ابراهيم شعبان",
//       "رقم الجلوس": 50010
//     }
//     // ... باقي الطلاب
//   ]
// };

// تحويل بيانات الطلاب من JSON إلى كائن
const studentData = {};

jsonData.resalt.forEach((student) => {
  const seatNumber = student["رقم الجلوس"];
  const studentName = student["الاسم"];
  const studentAverage = student["المعدل"];
  
  const subjects = {
    "تطبيقات الانترنت والوسائط المتعددة": student["تطبيقات الانترنت والوسائط المتعددة"],
    "اقتصاديات التمويل الدولى ": student["اقتصاديات التمويل الدولى "],
    "محاسبة التكاليف ": student["محاسبة التكاليف "],
    "المراجعة": student["المراجعة"],
    "فن الاعلان والعلاقات العامة": student["فن الاعلان والعلاقات العامة"],
    // "مبادئ الاقتصاد": student["مبادئ الاقتصاد" ],
    // "سلوك تنظيمي": student[ "سلوك تنظيمي"],
    // ... باقي المواد
  };

  studentData[seatNumber] = {
    name: studentName,
    average: studentAverage,
    subjects: subjects,
  };
});

// الجزء الذي قمت بتقديمه لإظهار نتائج الطلاب
document.addEventListener("DOMContentLoaded", function () {
  const seatNumberInput = document.getElementById("seat-number");
  const searchButton = document.getElementById("search-button");
  const resultContainer = document.getElementById("result-container");

  if (searchButton && seatNumberInput && resultContainer) {
    searchButton.addEventListener("click", () => {
      const seatNumber = seatNumberInput.value;
      const studentInfo = studentData[seatNumber];


    
    if (studentInfo) {
      let navh = document.getElementsByClassName("list-h")
      navh[0].style.display = "none"
console.log(navh)
      let nav = document.querySelectorAll("nav")
    nav[0].style.display = "none"
    nav[1].style.display = "none"


      let set = document.querySelector("input")
      set.style.display = "none"
      
      let but = document.querySelector("button")
      but.style.display = "none"

      let label = document.querySelector("label")
      label.style.display = "none"


    console.log(set)

          
        const resultDiv = document.createElement("div");
        resultDiv.className = "result";
        resultDiv.style.direction = "rtl";
        resultDiv.innerHTML = `
                <h3>${studentInfo.name}</h3>
                <p>المعدل: ${studentInfo.average}</p>
                <h4>نتائج المواد:</h4>
                <ul class="ude" style=" padding: 10px; justify-content: space-evenly; margin: 4px; align-items: center;">
                    ${Object.entries(studentInfo.subjects)
                      .map(
                        ([subject, grade]) =>
                          `<li  class = "degr" style="    padding: 11px;
                          box-sizing: border-box;
                          width: 69%;
                          margin: 5px;
                          border: 1px solid;">   ${subject}: ${grade}</li><br>`
                      )
                      .join("")}
                </ul>
            `;
        resultContainer.innerHTML = "";
        resultContainer.appendChild(resultDiv);
      } else {
        resultContainer.innerHTML = "<p>لا توجد معلومات  لرقم الجلوس].</p>";
      }
    });
  } else {
    console.error("One or more elements not found or not loaded properly.");
  }
});





















// searchButton.addEventListener("click", () => {
//     const seatNumber = seatNumberInput.value;
//     const studentInfo = studentData[seatNumber];

//     if (studentInfo) {
//         window.location.href = "results.html";
//         const resultDiv = document.createElement("div");
//         resultDiv.className = "result";
//         resultDiv.style.direction = "rtl";
//         resultDiv.innerHTML = `
//             <h2>${studentInfo.name}</h2>
//             <p>المعدل: ${studentInfo.average}</p>
//             <h3>نتائج المواد:</h3>
//             <ul style="display: flex; padding: 10px; justify-content: space-evenly; margin: 4px; align-items: center;">
//                 ${Object.entries(studentInfo.subjects)
//                     .map(([subject, grade]) => `<li style="padding: 10px; margin: 4px; border: 1px solid;">${subject}: ${grade}</li>`)
//                     .join("")}
//             </ul>
//         `;
//         resultContainer.innerHTML = "";
//         resultContainer.appendChild(resultDiv);
//     } else {
//         resultContainer.innerHTML = "<p>لا توجد معلومات لهذا رقم جلوس].</p>";
//     }
// });
